# concatination

In [2]:
import numpy as np
import pandas as pd

In [17]:
df1 = pd.DataFrame({
    'A1' : ['A1','A2','A3'],
    'B1' : ['B1','B2','B3'],
    'C1' : ['C1','C2','C3']
})

df2 = pd.DataFrame({
    'A1' : ['X1','X2','X3'],
    'B1' : ['Y1','Y2','Y3'],
    'C1' : ['Z1','Z2','Z3']
 })

In [18]:
df1

   A1  B1  C1
0  A1  B1  C1
1  A2  B2  C2
2  A3  B3  C3

In [19]:
df2

   A1  B1  C1
0  X1  Y1  Z1
1  X2  Y2  Z2
2  X3  Y3  Z3

In [20]:
pd.concat([df1,df2])

   A1  B1  C1
0  A1  B1  C1
1  A2  B2  C2
2  A3  B3  C3
0  X1  Y1  Z1
1  X2  Y2  Z2
2  X3  Y3  Z3

In [21]:
pd.concat([df1,df2],axis=1)

   A1  B1  C1  A1  B1  C1
0  A1  B1  C1  X1  Y1  Z1
1  A2  B2  C2  X2  Y2  Z2
2  A3  B3  C3  X3  Y3  Z3